Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
layer_name (Dense)           (None, 12, 12, 42)        546       
=================================================================
Total params: 546
Trainable params: 546
Non-trainable params: 0
_________________________________________________________________
